# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы (надо погуглить).

a = 1
b = 1.5
c = True
d = "Four"
e = None

print (type(a))
print (type(b))
print (type(c))
print (type(d))
print (type(e))