#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

a = int(input())
b = int(input())

summ = a + b
print (summ)
diff = a - b
print (diff)
div = a/b
print (div)
mult = a*b
print (mult)
print (a//b)
print (a%b)
print (a**b)